src/posts/hegel-contradiction.org
#+TITLE: On the Origins of Inherent Contradiction in Hegel's /Lesser Logic/
#+AUTHOR: 422.press
#+EMAIL: 422press@gmail.com
#+DATE: 10/8
#+OPTIONS: toc:nil num:nil date:nil

In his discussions of the Logical moment of the dialectic, Hegel _appears_ to be asserting something
along the lines of 'everything is inherently contradictory'. Indeed, in the _Addition_ to §48,
Hegel, asserts that the "true and positive significance" of Kant's antinomies[fn::By antinomy, Hegel
means no more than a contradiction in which both positions are equally justified: "the assertion of
two \textit{opposed} propositions about \textit{the same} ob-ject... each of the propositions must
be affirmed with equal necessity" (91).] is that "everything actual contains opposed determinations
within it" such that "comprehension of an ob-ject amounts precisely to our becoming conscious of it
as a concrete unity of opposed determinations" (93)[fn::All translated quotations, page numbers, and
section numbers found in this paper are taken from /The Encyclopaedia Logic: Part 1 of the
Encyclopaedia of Philosophical Sciences with the Zusätze/, translated by T.F. Geraets, W. A.
Suchting, and H. S. Harris published by Hacket in 1991.]. Or, in the _Remark_, that "antinomy is
found not only in the [Kant's] four particular ob-jects taken from cosmology, but rather in _all_
objects of all kinds, in _all_ representations, concepts, and ideas" (92). But what is less clear is
from where these inherent contradictions arise.

What proceeds is an exegetical account of---and a coming to grips with---the **origins** of Hegelian
contradiction that is inherent or inward. In doing so, I hope to shed light on **what** inherent
contradiction amounts to within the _Lesser Logic_, **why** Hegel thinks it to be found in
everything real, and finally its **importance** to Hegel as the constitutive property of the
dialectical moment of logical thinking.

Something should be said about the similarity between my current project and Thomas Bole's essay
/Contradiction in Hegel's Science of Logic/ [fn:: /Review of Metaphysics/ 40 (March 1987): 515-534].
Without a doubt, Bole is the primary source of inspiration for what is written here. However, I seek
further clarification of the origins of contradiction within the _Lesser Logic_. Bole finds Hegel's
assertion that 'everything is inherently contradictory' to be inconsistent with the Logic, whereas I
try to fit it into a reading of the _Lesser Logic_. Moreover, Bole circumscribes contradiction
within the content of the Logic, whereas I begin with considering contradiction within the form of
the logic and its division. The result is that, for Bole, contradiction (or its category) figures
into the logic as a secondary player as "that structure of negativity in which each of the relate is
what it is by denying its own identity as something contradistinguished from its other and
identifying itself with that other" (525). Bole's conception of contradiction is primarily
ascertained from the "unpacking of the structure of reflection", and as a result finds its use
merely as a theoretical requirement for reflection as opposed to an impetus for dialectic as well as
part of its result, as I find it to be.

