posts/hegel-contradiction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-16 Mon 15:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On the Origins of Inherent Contradiction in Hegel's <i>Lesser Logic</i></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="422.press" />
</head>
<body>
<div id="content">
<h1 class="title">On the Origins of Inherent Contradiction in Hegel's <i>Lesser Logic</i></h1>
<p>
In his discussions of the Logical moment of the dialectic, Hegel <span class="underline">appears</span> to be asserting something
along the lines of 'everything is inherently contradictory'. Indeed, in the <span class="underline">Addition</span> to §48,
Hegel, asserts that the "true and positive significance" of Kant's antinomies<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> is that "everything actual contains opposed determinations
within it" such that "comprehension of an ob-ject amounts precisely to our becoming conscious of it
as a concrete unity of opposed determinations" (93)<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Or, in the <span class="underline">Remark</span>, that "antinomy is
found not only in the [Kant's] four particular ob-jects taken from cosmology, but rather in <span class="underline">all</span>
objects of all kinds, in <span class="underline">all</span> representations, concepts, and ideas" (92). But what is less clear is
from where these inherent contradictions arise.
</p>

<p>
What proceeds is an exegetical account of&#x2014;and a coming to grips with&#x2014;the <b><b>origins</b></b> of Hegelian
contradiction that is inherent or inward. In doing so, I hope to shed light on <b><b>what</b></b> inherent
contradiction amounts to within the <span class="underline">Lesser Logic</span>, <b><b>why</b></b> Hegel thinks it to be found in
everything real, and finally its <b><b>importance</b></b> to Hegel as the constitutive property of the
dialectical moment of logical thinking.
</p>

<p>
Something should be said about the similarity between my current project and Thomas Bole's essay
<i>Contradiction in Hegel's Science of Logic</i> <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.
Without a doubt, Bole is the primary source of inspiration for what is written here. However, I seek
further clarification of the origins of contradiction within the <span class="underline">Lesser Logic</span>. Bole finds Hegel's
assertion that 'everything is inherently contradictory' to be inconsistent with the Logic, whereas I
try to fit it into a reading of the <span class="underline">Lesser Logic</span>. Moreover, Bole circumscribes contradiction
within the content of the Logic, whereas I begin with considering contradiction within the form of
the logic and its division. The result is that, for Bole, contradiction (or its category) figures
into the logic as a secondary player as "that structure of negativity in which each of the relate is
what it is by denying its own identity as something contradistinguished from its other and
identifying itself with that other" (525). Bole's conception of contradiction is primarily
ascertained from the "unpacking of the structure of reflection", and as a result finds its use
merely as a theoretical requirement for reflection as opposed to an impetus for dialectic as well as
part of its result, as I find it to be.
</p>
