posts/hegel-contradiction.html

<div id="outline-container-orga254502" class="outline-2">
<h2 id="orga254502">Origins of Contradiction</h2>
<div class="outline-text-2" id="text-orga254502">
<p>
In at least one place in the Logic, Hegel characterizes contradiction as the fundamental property of
the dialectical moment. We might, then, be tempted to conclude that the origins of contradiction lie
in the dialectical moment as well. However, Hegel, in his discussion of Kant in §48, attributes the
discovery of the antinomies to the logical position of the understanding, placing them prior to the
genuine dialectical moment. Kant's great achievement is the realization, from the perspective of the
understanding, that the categories themselves bring about the contradiction: "this thought, that the
contradiction which is posited by the determinations of the understanding in what is rational is
<span class="underline">essential</span> and <span class="underline">necessary</span>, has to be considered one of the most important and profound advances of
the philosophy of modern times" (92). Insofar as Kant thinks from the perspective of the
understanding, and insofar as his antinomies bring us into contact with true contradiction, then,
without ever leaving the first moment of the logical idea, we are confronted with inherent
contradiction.
</p>

<p>
This contradiction has divergent implications for reason in Kant and Hegel. The Kantian move is to
find that this contradiction lies not in the object itself but rather is the fault of reason and its
cognition of the object, keeping intact the consistency of the world at the cost of the consistency
of reason. Hegel instead brings the object into the realm of immanence, and so brings the object's
inherent contradiction (opposed determinations) into rationality as well. Within the speculative
logic, objects are comprehended in their truth in virtue of the appreciation of the concrete unity
of their opposed determinations, i.e. in virtue of the appreciation their inherent contradiction.
Contradiction, once again, lies within (is inherent to) the object or, speculatively comprehended,
within thinking, and is discovered within the moment of understanding. If contradiction had its
origins somewhere outside of the moment of the understanding or was not prior to the dialectical
moment, then in what sense could a thinking rooted in the understanding be said to discover it?
</p>

<p>
But perhaps this priority ascribed to contradiction over the dialectical is itself a one-sided
abstraction of the Logical truth. Recall that the three divisions of the Logic are "moments of
everything logically real, i.e., of every concept or of everything true in general" that, however,
can only be held apart within the moment of the understanding, and in doing so, lose their truth
(125). If the truth of the logically real depends upon keeping together the logical moments as
moments of the Concept, then talk of such temporality is seemingly misguided. On the other hand,
Hegel is no stranger to talk of <span class="underline">movement</span> between concepts and their determinations. Determinations
are first immediate, <span class="underline">then</span> mediated, etc. The resolution is to understand temporal talk in Hegel's
categorial development as analogously immanent and categorial, i.e. as an ordering of the categories
in thinking. So when I say that contradiction is prior to dialectic, I mean that contradiction is
prior to dialectic in the development of the categories in thinking. Yet, so long as contradiction
is prior and not appreciated within the concrete unity of the Concept, then it is not known in its
truth. Therefore, what is left to be said about contradiction within this current delimitation is
its place within the logic as a singular, untrue moment of the logic.
</p>

<p>
So, towards answering our question on the origins of Hegelian inherent contradiction, we can say
that inherent contradiction is prior in order to the dialectical moment, that it must fall somewhere
between the logical moments of understanding and dialectic. Hegel gives an abstract account of these
two logical moments in his overview of the division of logic, shining light on their interrelation
(§80 and §81, respectively):
</p>

<blockquote>
<p>
Thinking as understanding stops short at the fixed determinacy and its distinctness vis-a-vis
other determinacies; such a restricted abstraction counts for the understanding as one that
subsists on its own account, and simply is (123).
</p>
</blockquote>

<p>
From the perspective of understanding, objects and their determinations are distinguished from each
other without a proper appreciation for what they truly amount to. Objects are separated and
abstracted, <span class="underline">opposed</span>. However, the understanding makes the reverse conclusion: it sees its limited
account of the object as independent, where it really is an account grounded entirely in dependency
towards other objects.
</p>

<blockquote>
<p>
The dialectical moment is the self-sublation of these finite determinations [of the understanding]
on their own part, and their passing into their opposites (128).
</p>
</blockquote>

<p>
In the dialectic, objects and their isolated, finite determinations are self-sublated, the result of
which is the negation of their determinations. Within this moment, the determinations of the object
and their negation find themselves in some sort of coexistence or passing, however in this
coexistence they are not independent as they were in the understanding. Hegel calls the dialectic
immanent transcending for this reason: entirely within the object, the isolated determinations found
from the moment of the understanding are transcended, by means of their own sublation, into
something new, their negation. The negated determination is no longer isolated as it was in the
understanding, it is posited in relationship.
</p>

<p>
The dialectic, then, is in some sense a <span class="underline">resolution</span> of the inherent contradictions in objects found
by the understanding. The need to resolve these inherent contradictions is the very impetus for the
dialectic: "the finite sublates itself because it contradicts itself inwardly" (129), the result of
which is not more contradiction, but rather is something-concrete, the negation of the original
determinations. When Hegel says that everything finite is its own sublation, it is because
everything finite is inherently contradictory. Perhaps this is why Hegel characterizes dialectic as
immanent coherence: it comprehends the incoherence of inherent contradiction through their
self-sublation. Contradiction has its origins in the moment of the understanding (the abstract
either-or) but finds its statement and resolution within dialectic (the principle of movement).
</p>
</div>
</div>
