posts/hegel-contradiction.html

<div id="outline-container-org20ffc6c" class="outline-2">
<h2 id="org20ffc6c">The Movement from Pure Being to Being-there</h2>
<div class="outline-text-2" id="text-org20ffc6c">
<p>
It may help to consider an example. Let us consider the further categorization of, or movement from,
the category of being to the category of being-there at the final moment in which becoming inwardly
collapses, resulting in being-there. At this point in the Logic, being has been found in its
ultimate immediacy to be pure being. Pure being, in its turn, has been found to be pure abstraction
which, taken immediately, is nothing. We have posited that (empty and abstract) being is the same as
or identical to (empty and abstract) nothing. That is to say, being and nothing have passed into
their opposites; we have undertaken a dialectical turn. From the position of the understanding,
being and nothing are held separate and fixed. As we inspect being, we find it to be nothing which
we understand to be contradictory. The dialectical move is to overcome the opposed determinations
via positing becoming as their <span class="underline">simple</span> unity (without relation) as the determinate result.
Becoming, as the result or affirmation contained within the contradiction, is itself inherently
contradictory and unstable, as it does not relate being and nothing within itself and has not gone
beyond the negative. Therefore, it must give way to the speculative move, to being-there (§89):
</p>

<blockquote>
<p>
In becoming, being, as one with nothing, and nothing as one with being, are only vanishing (terms);
because of its contradiction becoming collapses inwardly into the unity within which both are
sublated; in this way its result is <span class="underline">being-there</span> (145).
</p>
</blockquote>

<p>
Becoming contains an inherent contradiction, the simple unity of being and nothing. Being there is
the true, speculative resolution of the half-abstracted, half-concrete result of the becoming, the
previous dialectical result. Hegel states in the following <span class="underline">Remark</span>, "being-there is the unity of
being and nothing, in which the immediacy of these determinations, and therewith their contradiction
[in the dialectical result of becoming], has disappeared in their relation" (146). There is no
mistaking that becoming, the result of the previous dialectic, is inherently contradictory.
</p>

<p>
It seems from this example that, in at least some sense, the result of dialectical moment includes
more contradiction. This new "more contradiction" is the introduction of a new contradiction rather
than a continuation of the old one, which was the impetus for the dialectical movement in the first
place. In the case of becoming, the first contradiction was the identity of being and nothing. The
second contradiction was their simple unity. The dialectical result is still something-concrete, but
also at the same time something-abstract. It follows that the dialectical moment itself is
responsible for inducing new inherent contradictions into logical reasoning.
</p>

<p>
How can this characterization of inherent contradiction as a product of dialectic be reconciled with
the supposed priority of inherent contradiction to dialectic? I'm not entirely sure. One solution
may be to understand this new contradiction as prior to the <span class="underline">next</span> dialectic movement and subsequent
to the last. In this way, some inherent contradiction is always there for dialectical reasoning to
overthrow into its opposite and move towards resolution. Within the Concept, this would inscribe
inherent contradiction within all its moments. But how would this explain the universality of
inherent contradiction <span class="underline">from the perspective of the understanding</span>? The point, it seems, is that,
from the perspective of understanding, one cannot see the inherent contradiction in all objects and
concepts. It is only within the Concept and through the dialectical movement in which inherent
contradiction shows itself in everything real.
</p>
</div>
</div>
