src/posts/hegel-contradiction.org
* Appreciating Inherent Contradiction

Taking dialectical to be both the resolution and the origin of inherent contradiction, we can try to
answer why Hegel thinks inherent contradiction is found in everything actual. Inherent contradiction
is no more than the opposed determinations found within every object or concept. It differs from
contradiction as such in that it is inward and immanent, never in regards to an external other.
Wherever one finds dialectic, one will also find the annihilation and preservation of contradiction.
Insofar as what is actual is rational, reality is structured by the categorial logic, and so must
undergo the dialectical moment, and so also inherent contradiction.

Therefore, the Hegelian claim that 'everything is inherently contradictory' is no more offensive or
incorrect than the claim that 'the three parts of the logic are moments of everything real'.
Inherent contradiction is both the motivation for and the result of the dialectical moment. To
assert the inherent contradiction within an object is to emphasize the object's passing through the
dialectical moment as part of the unfolding of the categorial development.

Inherent contradiction, then, serves many purposes within the Logic. In the context of history of
philosophy, it was the inherent contradiction of the antinomies that turned thinking towards itself,
and so towards immanence. Before Kant, Cosmology dealt with the world and constructed absolute
antitheses (e.g. freedom and necessity). The inherent contradictions found within these antitheses,
and so of the world, resulted in the innovation that Cosmology dealt not with the world-in-itself,
but rather the world as it appears and that the inherent contradictions, the antitheses, were in the
faulty cognition of this appearance as opposed to the world-in-itself. Hegel sees his realization
that 'everything is inherently contradictory' as the fundamental innovation of his philosophical
thinking[fn::In the /Remark/ already quoted in the introduction, Hegel asserts that "To know this
[that antinomy is founds not only in the four particular ob-jects taken from Cosmology, but rather
in /all/ objects of all kinds, in /all/ representations, concepts, and ideas], and to be cognizant
of this property of ob-jects, belongs to what is essential in philosophical study" (90).], and in
this way inherent contradiction can be said to be important for Hegel.

However, inherent contradiction is also important for Hegel as the impetus and source of movement
throughout the dialectical moment. The categorial justification for movements between the categories
is that to do so is to advance on the categorial hierarchy, from a category that is more abstract
and less determinate to a category that is less abstract and more determinate. The positing and
resolving of inherent contradiction allows for this deepening of determination, as the resolution of
contradiction involves the inscribing of two determinations into one. Moreover, the contradictory
nature of the categories secures the necessity of their movements. The fact that inherent
contradiction lay behind ensures that the categories develop in the right way, through the
resolution of the contradiction at hand, i.e. through the self-sublation of the finite and opposed
determinations.

On a final note, if one denies that Hegelian logic is committed to inherent contradiction, as Bole
does, there would seem to be potential problems in how Hegel places himself in the philosophical
tradition and his characterization of his Logic. On the other hand, a 'inherently contradictory'
reading of the Logic is at least possible, and allows Hegel to remain consistent within his own
text. If inherent contradiction is no worse than what is found here, then we should be careful to
dismiss it on grounds of its absurdity, less the critique fall on the entire Logic itself.

